In [9]:
#1. give the even number
p = int(input("Enter the no.: "))
q = int(input("Enter the no.: "))
r = int(input("Enter the no.: "))
s = int(input("Enter the no.: "))
w = int(input("Enter the no.: "))
t = int(input("Enter the no.: "))
y = int(input("Enter the no.: "))
u = int(input("Enter the no.: "))
k = int(input("Enter the no.: "))
a = int(input("Enter the no.: "))

lst = [p,q,r,s,w,t,y,u,k,a]
my_lst = [lst for lst in lst if lst%2==0]
my_lst

Enter the no.:  1
Enter the no.:  2
Enter the no.:  3
Enter the no.:  4
Enter the no.:  5
Enter the no.:  6
Enter the no.:  7
Enter the no.:  8
Enter the no.:  9
Enter the no.:  10

[2, 4, 6, 8, 10]

In [18]:
#2. count the frequency of dictionary 
var = input("Enter the string: ")

res={}
for i in var:
    if i in res:
        res[i]+=1
    else:
        res[i]=1
print(res)

Enter the string:  palak

{'p': 1, 'a': 2, 'l': 1, 'k': 1}

In [19]:
with open (r"C:\Users\gupta\OneDrive\Desktop\data.txt\data.txt", 'r') as f:
    txt = f.read()

txt

'Hi i am palak'

In [20]:
total_words = len(txt)
total_words

13

In [23]:
word={}
for i in txt:
    if i in word:
        word[i]+=1
    else:
        word[i]=1
print(word)

{'H': 1, 'i': 2, ' ': 3, 'a': 3, 'm': 1, 'p': 1, 'l': 1, 'k': 1}

In [2]:
#Part -B DataFrame
import pandas as pd
data = {'ID': [1,2,3,4,5,6],
        'Name': ['Riya','Aarav','Neha','Karan','Priya','Mohit'],
        'Age': [20,21,22,23,21,22],
        'Department': ['CS','IT','CS','ECE','IT','CS'],
        'Marks': [85,78,92,67,74,89]}
df = pd.DataFrame(data)
print(df)

   ID   Name  Age Department  Marks
0   1   Riya   20         CS     85
1   2  Aarav   21         IT     78
2   3   Neha   22         CS     92
3   4  Karan   23        ECE     67
4   5  Priya   21         IT     74
5   6  Mohit   22         CS     89

In [6]:
#First 3 rows
df.head(3)

   ID   Name  Age Department  Marks
0   1   Riya   20         CS     85
1   2  Aarav   21         IT     78
2   3   Neha   22         CS     92

In [8]:
#Shape of the dataFrame
df.shape

(6, 5)

In [10]:
#Marks>80
name= df[(df['Department'] == 'CS') & (df['Marks'] > 80)]
name

   ID   Name  Age Department  Marks
0   1   Riya   20         CS     85
2   3   Neha   22         CS     92
5   6  Mohit   22         CS     89

In [3]:
# Average marks of department
df.groupby('Department')['Marks'].mean()

Department
CS     88.666667
ECE    67.000000
IT     76.000000
Name: Marks, dtype: float64

In [12]:
#pass & Fail
def result(Marks):
    if Marks>75:
        return"Pass"
    else:
        return"Fail"
df["Result"] = df["Marks"].apply(result)
df

   ID   Name  Age Department  Marks Result
0   1   Riya   20         CS     85   Pass
1   2  Aarav   21         IT     78   Pass
2   3   Neha   22         CS     92   Pass
3   4  Karan   23        ECE     67   Fail
4   5  Priya   21         IT     74   Fail
5   6  Mohit   22         CS     89   Pass

In [14]:
#descending order
newdf = df.sort_values(by = 'Marks',ascending = False)
newdf

   ID   Name  Age Department  Marks Result
2   3   Neha   22         CS     92   Pass
5   6  Mohit   22         CS     89   Pass
0   1   Riya   20         CS     85   Pass
1   2  Aarav   21         IT     78   Pass
4   5  Priya   21         IT     74   Fail
3   4  Karan   23        ECE     67   Fail

In [16]:
#CSV file
newdf.to_csv('students_results.csv', index = False)
print("Task done successsfully.")

Task done successsfully.